idallasjlabs/agentshroud/firmware/voice-terminal/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# Flash
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Octal PSRAM — required for MicroLink TLS headroom
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y

# BOX-3 BSP board selection
CONFIG_BSP_BOARD_ESP32_S3_BOX_3=y

# CPU / power
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# FreeRTOS tick rate
CONFIG_FREERTOS_HZ=1000

# WiFi
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Force esp_codec_dev to use legacy I2C driver — avoids conflict with BSP v1.1.3
CONFIG_CODEC_I2C_BACKWARD_COMPATIBLE=y

# LVGL fonts
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_28=y

# Fix ILI9341 RGB565 byte order (little-endian CPU, big-endian display)
CONFIG_LV_COLOR_16_SWAP=y

# WiFi credentials (SSID pre-set; set password via: idf.py menuconfig → Voice Terminal Config)
CONFIG_VT_WIFI_SSID="ford-prefect"
CONFIG_VT_WIFI_PASSWORD=""
